Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-SG60_DFP/1.1.122/edc/PIC32CX1025SG60100.PIC
      <edc:SFRDef ltx:memberofperipheral="GCLK" edc:cname="PCHCTRL13" edc:nzwidth="0x20" edc:access="------------------------nn--nnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0xCF" edc:_addr="0x40001CB4">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="GCLK">
            <edc:SFRFieldDef edc:cname="GEN" edc:nzwidth="0x4" edc:desc="Generic Clock Generator">
              <edc:SFRFieldSemantic edc:cname="GCLK0" edc:desc="Generic clock generator 0" edc:when="(field &amp; 0xF) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="GCLK1" edc:desc="Generic clock generator 1" edc:when="(field &amp; 0xF) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="GCLK2" edc:desc="Generic clock generator 2" edc:when="(field &amp; 0xF) == 0x02"/>
              <edc:SFRFieldSemantic edc:cname="GCLK3" edc:desc="Generic clock generator 3" edc:when="(field &amp; 0xF) == 0x03"/>
              <edc:SFRFieldSemantic edc:cname="GCLK4" edc:desc="Generic clock generator 4" edc:when="(field &amp; 0xF) == 0x04"/>
              <edc:SFRFieldSemantic edc:cname="GCLK5" edc:desc="Generic clock generator 5" edc:when="(field &amp; 0xF) == 0x05"/>
              <edc:SFRFieldSemantic edc:cname="GCLK6" edc:desc="Generic clock generator 6" edc:when="(field &amp; 0xF) == 0x06"/>
              <edc:SFRFieldSemantic edc:cname="GCLK7" edc:desc="Generic clock generator 7" edc:when="(field &amp; 0xF) == 0x07"/>
              <edc:SFRFieldSemantic edc:cname="GCLK8" edc:desc="Generic clock generator 8" edc:when="(field &amp; 0xF) == 0x08"/>
              <edc:SFRFieldSemantic edc:cname="GCLK9" edc:desc="Generic clock generator 9" edc:when="(field &amp; 0xF) == 0x09"/>
              <edc:SFRFieldSemantic edc:cname="GCLK10" edc:desc="Generic clock generator 10" edc:when="(field &amp; 0xF) == 0x0A"/>
              <edc:SFRFieldSemantic edc:cname="GCLK11" edc:desc="Generic clock generator 11" edc:when="(field &amp; 0xF) == 0x0B"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="CHEN" edc:nzwidth="0x1" edc:desc="Channel Enable"/>
            <edc:SFRFieldDef edc:cname="WRTLOCK" edc:nzwidth="0x1" edc:desc="Write Lock"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="GCLK" edc:cname="PCHCTRL14" edc:nzwidth="0x20" edc:access="------------------------nn--nnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0xCF" edc:_addr="0x40001CB8">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="GCLK">
            <edc:SFRFieldDef edc:cname="GEN" edc:nzwidth="0x4" edc:desc="Generic Clock Generator">
              <edc:SFRFieldSemantic edc:cname="GCLK0" edc:desc="Generic clock generator 0" edc:when="(field &amp; 0xF) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="GCLK1" edc:desc="Generic clock generator 1" edc:when="(field &amp; 0xF) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="GCLK2" edc:desc="Generic clock generator 2" edc:when="(field &amp; 0xF) == 0x02"/>
              <edc:SFRFieldSemantic edc:cname="GCLK3" edc:desc="Generic clock generator 3" edc:when="(field &amp; 0xF) == 0x03"/>
              <edc:SFRFieldSemantic edc:cname="GCLK4" edc:desc="Generic clock generator 4" edc:when="(field &amp; 0xF) == 0x04"/>
              <edc:SFRFieldSemantic edc:cname="GCLK5" edc:desc="Generic clock generator 5" edc:when="(field &amp; 0xF) == 0x05"/>
              <edc:SFRFieldSemantic edc:cname="GCLK6" edc:desc="Generic clock generator 6" edc:when="(field &amp; 0xF) == 0x06"/>
              <edc:SFRFieldSemantic edc:cname="GCLK7" edc:desc="Generic clock generator 7" edc:when="(field &amp; 0xF) == 0x07"/>
              <edc:SFRFieldSemantic edc:cname="GCLK8" edc:desc="Generic clock generator 8" edc:when="(field &amp; 0xF) == 0x08"/>
              <edc:SFRFieldSemantic edc:cname="GCLK9" edc:desc="Generic clock generator 9" edc:when="(field &amp; 0xF) == 0x09"/>
              <edc:SFRFieldSemantic edc:cname="GCLK10" edc:desc="Generic clock generator 10" edc:when="(field &amp; 0xF) == 0x0A"/>
              <edc:SFRFieldSemantic edc:cname="GCLK11" edc:desc="Generic clock generator 11" edc:when="(field &amp; 0xF) == 0x0B"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="CHEN" edc:nzwidth="0x1" edc:desc="Channel Enable"/>
            <edc:SFRFieldDef edc:cname="WRTLOCK" edc:nzwidth="0x1" edc:desc="Write Lock"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="GCLK" edc:cname="PCHCTRL15" edc:nzwidth="0x20" edc:access="------------------------nn--nnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0xCF" edc:_addr="0x40001CBC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="GCLK">
            <edc:SFRFieldDef edc:cname="GEN" edc:nzwidth="0x4" edc:desc="Generic Clock Generator">
              <edc:SFRFieldSemantic edc:cname="GCLK0" edc:desc="Generic clock generator 0" edc:when="(field &amp; 0xF) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="GCLK1" edc:desc="Generic clock generator 1" edc:when="(field &amp; 0xF) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="GCLK2" edc:desc="Generic clock generator 2" edc:when="(field &amp; 0xF) == 0x02"/>
              <edc:SFRFieldSemantic edc:cname="GCLK3" edc:desc="Generic clock generator 3" edc:when="(field &amp; 0xF) == 0x03"/>
              <edc:SFRFieldSemantic edc:cname="GCLK4" edc:desc="Generic clock generator 4" edc:when="(field &amp; 0xF) == 0x04"/>
              <edc:SFRFieldSemantic edc:cname="GCLK5" edc:desc="Generic clock generator 5" edc:when="(field &amp; 0xF) == 0x05"/>
              <edc:SFRFieldSemantic edc:cname="GCLK6" edc:desc="Generic clock generator 6" edc:when="(field &amp; 0xF) == 0x06"/>
              <edc:SFRFieldSemantic edc:cname="GCLK7" edc:desc="Generic clock generator 7" edc:when="(field &amp; 0xF) == 0x07"/>
              <edc:SFRFieldSemantic edc:cname="GCLK8" edc:desc="Generic clock generator 8" edc:when="(field &amp; 0xF) == 0x08"/>
              <edc:SFRFieldSemantic edc:cname="GCLK9" edc:desc="Generic clock generator 9" edc:when="(field &amp; 0xF) == 0x09"/>
              <edc:SFRFieldSemantic edc:cname="GCLK10" edc:desc="Generic clock generator 10" edc:when="(field &amp; 0xF) == 0x0A"/>
              <edc:SFRFieldSemantic edc:cname="GCLK11" edc:desc="Generic clock generator 11" edc:when="(field &amp; 0xF) == 0x0B"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="CHEN" edc:nzwidth="0x1" edc:desc="Channel Enable"/>
            <edc:SFRFieldDef edc:cname="WRTLOCK" edc:nzwidth="0x1" edc:desc="Write Lock"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
