Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-SG60_DFP/1.1.122/edc/PIC32CX1025SG60100.PIC
      <edc:SFRDef ltx:memberofperipheral="NVMCTRL" edc:cname="RUNLOCK" edc:nzwidth="0x20" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x41004018">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="NVMCTRL">
            <edc:SFRFieldDef edc:cname="RUNLOCK" edc:nzwidth="0x20" edc:desc="Region Un-Lock Bits"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="NVMCTRL" edc:cname="PBLDATA0" edc:nzwidth="0x20" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:por="11111111111111111111111111111111" edc:mclr="11111111111111111111111111111111" edc:_addr="0x4100401C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="NVMCTRL">
            <edc:SFRFieldDef edc:cname="DATA" edc:nzwidth="0x20" edc:desc="Page Buffer Data"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="NVMCTRL" edc:cname="PBLDATA1" edc:nzwidth="0x20" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:por="11111111111111111111111111111111" edc:mclr="11111111111111111111111111111111" edc:_addr="0x41004020">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="NVMCTRL">
            <edc:SFRFieldDef edc:cname="DATA" edc:nzwidth="0x20" edc:desc="Page Buffer Data"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="NVMCTRL" edc:cname="ECCERR" edc:nzwidth="0x20" edc:access="rrrr----rrrrrrrrrrrrrrrrrrrrrrrr" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0xF0FFFFFF" edc:_addr="0x41004024">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="NVMCTRL">
            <edc:SFRFieldDef edc:cname="ADDR" edc:nzwidth="0x18" edc:desc="Error Address"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="TYPEL" edc:nzwidth="0x2" edc:desc="Low Double-Word Error Type">
              <edc:SFRFieldSemantic edc:cname="NONE" edc:desc="No Error Detected Since Last Read" edc:when="(field &amp; 0x3) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="SINGLE" edc:desc="At Least One Single Error Detected Since last Read" edc:when="(field &amp; 0x3) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="DUAL" edc:desc="At Least One Dual Error Detected Since Last Read" edc:when="(field &amp; 0x3) == 0x02"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="TYPEH" edc:nzwidth="0x2" edc:desc="High Double-Word Error Type">
              <edc:SFRFieldSemantic edc:cname="NONE" edc:desc="No Error Detected Since Last Read" edc:when="(field &amp; 0x3) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="SINGLE" edc:desc="At Least One Single Error Detected Since last Read" edc:when="(field &amp; 0x3) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="DUAL" edc:desc="At Least One Dual Error Detected Since Last Read" edc:when="(field &amp; 0x3) == 0x02"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="NVMCTRL" edc:cname="DBGCTRL" edc:nzwidth="0x8" edc:access="------nn" edc:por="00000000" edc:mclr="00000000" edc:impl="0x3" edc:_addr="0x41004028">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="NVMCTRL">
            <edc:SFRFieldDef edc:cname="ECCDIS" edc:nzwidth="0x1" edc:desc="Debugger ECC Read Disable"/>
            <edc:SFRFieldDef edc:cname="ECCELOG" edc:nzwidth="0x1" edc:desc="Debugger ECC Error Tracking Mode"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="NVMCTRL" edc:cname="BCTRL" edc:nzwidth="0x8" edc:access="-------n" edc:por="00000000" edc:mclr="00000000" edc:impl="0x1" edc:_addr="0x41004029">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="NVMCTRL">
            <edc:SFRFieldDef edc:cname="BRPE" edc:nzwidth="0x1" edc:desc="Boot Read Protection Enable"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="NVMCTRL" edc:cname="SEECFG" edc:nzwidth="0x8" edc:access="------nn" edc:por="00000000" edc:mclr="00000000" edc:impl="0x3" edc:_addr="0x4100402A">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="NVMCTRL">
            <edc:SFRFieldDef edc:cname="WMODE" edc:nzwidth="0x1" edc:desc="Write Mode">
              <edc:SFRFieldSemantic edc:cname="UNBUFFERED" edc:desc="A NVM write command is issued after each write in the pagebuffer" edc:when="(field &amp; 0x1) == 0x00"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="APRDIS" edc:nzwidth="0x1" edc:desc="Automatic Page Reallocation Disable"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x1" edc:_addr="0x4100402B"/>
      <edc:SFRDef ltx:memberofperipheral="NVMCTRL" edc:cname="SEESTAT" edc:nzwidth="0x20" edc:access="-------------rrr----rrrr---rrr-r" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0x70F1D" edc:_addr="0x4100402C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="NVMCTRL">
            <edc:SFRFieldDef edc:cname="ASEES" edc:nzwidth="0x1" edc:desc="Active SmartEEPROM Sector"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="BUSY" edc:nzwidth="0x1" edc:desc="Busy"/>
            <edc:SFRFieldDef edc:cname="LOCK" edc:nzwidth="0x1" edc:desc="SmartEEPROM Write Access Is Locked"/>
            <edc:SFRFieldDef edc:cname="RLOCK" edc:nzwidth="0x1" edc:desc="SmartEEPROM Write Access To Register Address Space Is Locked"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="SBLK" edc:nzwidth="0x4" edc:desc="Blocks Number In a Sector"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="PSZ" edc:nzwidth="0x3" edc:desc="SmartEEPROM Page Size"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
