Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-SG60_DFP/1.1.122/edc/PIC32CX1025SG60100.PIC
      <edc:SFRDef ltx:memberofperipheral="SDHC1" edc:cname="EISTER" edc:nzwidth="0x10" edc:access="---n--nnnnnnnnnn" edc:por="0000000000000000" edc:mclr="0000000000000000" edc:impl="0x13FF" edc:_addr="0x46000036">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SDHC1">
            <edc:SFRFieldDef edc:cname="CMDTEO" edc:nzwidth="0x1" edc:desc="Command Timeout Error Status Enable">
              <edc:SFRFieldSemantic edc:cname="MASKED" edc:desc="Masked" edc:when="(field &amp; 0x1) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="ENABLED" edc:desc="Enabled" edc:when="(field &amp; 0x1) == 0x01"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="CMDCRC" edc:nzwidth="0x1" edc:desc="Command CRC Error Status Enable">
              <edc:SFRFieldSemantic edc:cname="MASKED" edc:desc="Masked" edc:when="(field &amp; 0x1) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="ENABLED" edc:desc="Enabled" edc:when="(field &amp; 0x1) == 0x01"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="CMDEND" edc:nzwidth="0x1" edc:desc="Command End Bit Error Status Enable">
              <edc:SFRFieldSemantic edc:cname="MASKED" edc:desc="Masked" edc:when="(field &amp; 0x1) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="ENABLED" edc:desc="Enabled" edc:when="(field &amp; 0x1) == 0x01"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="CMDIDX" edc:nzwidth="0x1" edc:desc="Command Index Error Status Enable">
              <edc:SFRFieldSemantic edc:cname="MASKED" edc:desc="Masked" edc:when="(field &amp; 0x1) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="ENABLED" edc:desc="Enabled" edc:when="(field &amp; 0x1) == 0x01"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="DATTEO" edc:nzwidth="0x1" edc:desc="Data Timeout Error Status Enable">
              <edc:SFRFieldSemantic edc:cname="MASKED" edc:desc="Masked" edc:when="(field &amp; 0x1) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="ENABLED" edc:desc="Enabled" edc:when="(field &amp; 0x1) == 0x01"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="DATCRC" edc:nzwidth="0x1" edc:desc="Data CRC Error Status Enable">
              <edc:SFRFieldSemantic edc:cname="MASKED" edc:desc="Masked" edc:when="(field &amp; 0x1) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="ENABLED" edc:desc="Enabled" edc:when="(field &amp; 0x1) == 0x01"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="DATEND" edc:nzwidth="0x1" edc:desc="Data End Bit Error Status Enable">
              <edc:SFRFieldSemantic edc:cname="MASKED" edc:desc="Masked" edc:when="(field &amp; 0x1) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="ENABLED" edc:desc="Enabled" edc:when="(field &amp; 0x1) == 0x01"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="CURLIM" edc:nzwidth="0x1" edc:desc="Current Limit Error Status Enable">
              <edc:SFRFieldSemantic edc:cname="MASKED" edc:desc="Masked" edc:when="(field &amp; 0x1) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="ENABLED" edc:desc="Enabled" edc:when="(field &amp; 0x1) == 0x01"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="ACMD" edc:nzwidth="0x1" edc:desc="Auto CMD Error Status Enable">
              <edc:SFRFieldSemantic edc:cname="MASKED" edc:desc="Masked" edc:when="(field &amp; 0x1) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="ENABLED" edc:desc="Enabled" edc:when="(field &amp; 0x1) == 0x01"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="ADMA" edc:nzwidth="0x1" edc:desc="ADMA Error Status Enable">
              <edc:SFRFieldSemantic edc:cname="MASKED" edc:desc="Masked" edc:when="(field &amp; 0x1) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="ENABLED" edc:desc="Enabled" edc:when="(field &amp; 0x1) == 0x01"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="BOOTAE" edc:nzwidth="0x1" edc:desc="Boot Acknowledge Error Status Enable"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="SDHC1" edc:cname="NISIER" edc:nzwidth="0x10" edc:access="-n-----nnnnnnnnn" edc:por="0000000000000000" edc:mclr="0000000000000000" edc:impl="0x41FF" edc:_addr="0x46000038">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SDHC1">
            <edc:SFRFieldDef edc:cname="CMDC" edc:nzwidth="0x1" edc:desc="Command Complete Signal Enable">
              <edc:SFRFieldSemantic edc:cname="MASKED" edc:desc="Masked" edc:when="(field &amp; 0x1) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="ENABLED" edc:desc="Enabled" edc:when="(field &amp; 0x1) == 0x01"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="TRFC" edc:nzwidth="0x1" edc:desc="Transfer Complete Signal Enable">
              <edc:SFRFieldSemantic edc:cname="MASKED" edc:desc="Masked" edc:when="(field &amp; 0x1) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="ENABLED" edc:desc="Enabled" edc:when="(field &amp; 0x1) == 0x01"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="BLKGE" edc:nzwidth="0x1" edc:desc="Block Gap Event Signal Enable">
              <edc:SFRFieldSemantic edc:cname="MASKED" edc:desc="Masked" edc:when="(field &amp; 0x1) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="ENABLED" edc:desc="Enabled" edc:when="(field &amp; 0x1) == 0x01"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="DMAINT" edc:nzwidth="0x1" edc:desc="DMA Interrupt Signal Enable">
              <edc:SFRFieldSemantic edc:cname="MASKED" edc:desc="Masked" edc:when="(field &amp; 0x1) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="ENABLED" edc:desc="Enabled" edc:when="(field &amp; 0x1) == 0x01"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="BWRRDY" edc:nzwidth="0x1" edc:desc="Buffer Write Ready Signal Enable">
              <edc:SFRFieldSemantic edc:cname="MASKED" edc:desc="Masked" edc:when="(field &amp; 0x1) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="ENABLED" edc:desc="Enabled" edc:when="(field &amp; 0x1) == 0x01"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="BRDRDY" edc:nzwidth="0x1" edc:desc="Buffer Read Ready Signal Enable">
              <edc:SFRFieldSemantic edc:cname="MASKED" edc:desc="Masked" edc:when="(field &amp; 0x1) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="ENABLED" edc:desc="Enabled" edc:when="(field &amp; 0x1) == 0x01"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="CINS" edc:nzwidth="0x1" edc:desc="Card Insertion Signal Enable">
              <edc:SFRFieldSemantic edc:cname="MASKED" edc:desc="Masked" edc:when="(field &amp; 0x1) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="ENABLED" edc:desc="Enabled" edc:when="(field &amp; 0x1) == 0x01"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="CREM" edc:nzwidth="0x1" edc:desc="Card Removal Signal Enable">
              <edc:SFRFieldSemantic edc:cname="MASKED" edc:desc="Masked" edc:when="(field &amp; 0x1) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="ENABLED" edc:desc="Enabled" edc:when="(field &amp; 0x1) == 0x01"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="CINT" edc:nzwidth="0x1" edc:desc="Card Interrupt Signal Enable">
              <edc:SFRFieldSemantic edc:cname="MASKED" edc:desc="Masked" edc:when="(field &amp; 0x1) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="ENABLED" edc:desc="Enabled" edc:when="(field &amp; 0x1) == 0x01"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x5"/>
            <edc:SFRFieldDef edc:cname="BOOTAR" edc:nzwidth="0x1" edc:desc="Boot Acknowledge Received Signal Enable"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="SDHC1" edc:cname="EISIER" edc:nzwidth="0x10" edc:access="---n--nnnnnnnnnn" edc:por="0000000000000000" edc:mclr="0000000000000000" edc:impl="0x13FF" edc:_addr="0x4600003A">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SDHC1">
            <edc:SFRFieldDef edc:cname="CMDTEO" edc:nzwidth="0x1" edc:desc="Command Timeout Error Signal Enable">
              <edc:SFRFieldSemantic edc:cname="MASKED" edc:desc="Masked" edc:when="(field &amp; 0x1) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="ENABLED" edc:desc="Enabled" edc:when="(field &amp; 0x1) == 0x01"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="CMDCRC" edc:nzwidth="0x1" edc:desc="Command CRC Error Signal Enable">
              <edc:SFRFieldSemantic edc:cname="MASKED" edc:desc="Masked" edc:when="(field &amp; 0x1) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="ENABLED" edc:desc="Enabled" edc:when="(field &amp; 0x1) == 0x01"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="CMDEND" edc:nzwidth="0x1" edc:desc="Command End Bit Error Signal Enable">
              <edc:SFRFieldSemantic edc:cname="MASKED" edc:desc="Masked" edc:when="(field &amp; 0x1) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="ENABLED" edc:desc="Enabled" edc:when="(field &amp; 0x1) == 0x01"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="CMDIDX" edc:nzwidth="0x1" edc:desc="Command Index Error Signal Enable">
              <edc:SFRFieldSemantic edc:cname="MASKED" edc:desc="Masked" edc:when="(field &amp; 0x1) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="ENABLED" edc:desc="Enabled" edc:when="(field &amp; 0x1) == 0x01"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="DATTEO" edc:nzwidth="0x1" edc:desc="Data Timeout Error Signal Enable">
              <edc:SFRFieldSemantic edc:cname="MASKED" edc:desc="Masked" edc:when="(field &amp; 0x1) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="ENABLED" edc:desc="Enabled" edc:when="(field &amp; 0x1) == 0x01"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="DATCRC" edc:nzwidth="0x1" edc:desc="Data CRC Error Signal Enable">
              <edc:SFRFieldSemantic edc:cname="MASKED" edc:desc="Masked" edc:when="(field &amp; 0x1) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="ENABLED" edc:desc="Enabled" edc:when="(field &amp; 0x1) == 0x01"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="DATEND" edc:nzwidth="0x1" edc:desc="Data End Bit Error Signal Enable">
              <edc:SFRFieldSemantic edc:cname="MASKED" edc:desc="Masked" edc:when="(field &amp; 0x1) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="ENABLED" edc:desc="Enabled" edc:when="(field &amp; 0x1) == 0x01"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="CURLIM" edc:nzwidth="0x1" edc:desc="Current Limit Error Signal Enable">
              <edc:SFRFieldSemantic edc:cname="MASKED" edc:desc="Masked" edc:when="(field &amp; 0x1) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="ENABLED" edc:desc="Enabled" edc:when="(field &amp; 0x1) == 0x01"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="ACMD" edc:nzwidth="0x1" edc:desc="Auto CMD Error Signal Enable">
              <edc:SFRFieldSemantic edc:cname="MASKED" edc:desc="Masked" edc:when="(field &amp; 0x1) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="ENABLED" edc:desc="Enabled" edc:when="(field &amp; 0x1) == 0x01"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="ADMA" edc:nzwidth="0x1" edc:desc="ADMA Error Signal Enable">
              <edc:SFRFieldSemantic edc:cname="MASKED" edc:desc="Masked" edc:when="(field &amp; 0x1) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="ENABLED" edc:desc="Enabled" edc:when="(field &amp; 0x1) == 0x01"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="BOOTAE" edc:nzwidth="0x1" edc:desc="Boot Acknowledge Error Signal Enable"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="SDHC1" edc:cname="ACESR" edc:nzwidth="0x10" edc:access="--------r--rrrrr" edc:por="0000000000000000" edc:mclr="0000000000000000" edc:impl="0x9F" edc:_addr="0x4600003C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SDHC1">
            <edc:SFRFieldDef edc:cname="ACMD12NE" edc:nzwidth="0x1" edc:desc="Auto CMD12 Not Executed">
              <edc:SFRFieldSemantic edc:cname="EXEC" edc:desc="Executed" edc:when="(field &amp; 0x1) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="NOT_EXEC" edc:desc="Not executed" edc:when="(field &amp; 0x1) == 0x01"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="ACMDTEO" edc:nzwidth="0x1" edc:desc="Auto CMD Timeout Error">
              <edc:SFRFieldSemantic edc:cname="NO" edc:desc="No error" edc:when="(field &amp; 0x1) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="YES" edc:desc="Timeout" edc:when="(field &amp; 0x1) == 0x01"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="ACMDCRC" edc:nzwidth="0x1" edc:desc="Auto CMD CRC Error">
              <edc:SFRFieldSemantic edc:cname="NO" edc:desc="No error" edc:when="(field &amp; 0x1) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="YES" edc:desc="CRC Error Generated" edc:when="(field &amp; 0x1) == 0x01"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="ACMDEND" edc:nzwidth="0x1" edc:desc="Auto CMD End Bit Error">
              <edc:SFRFieldSemantic edc:cname="NO" edc:desc="No error" edc:when="(field &amp; 0x1) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="YES" edc:desc="End Bit Error Generated" edc:when="(field &amp; 0x1) == 0x01"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="ACMDIDX" edc:nzwidth="0x1" edc:desc="Auto CMD Index Error">
              <edc:SFRFieldSemantic edc:cname="NO" edc:desc="No error" edc:when="(field &amp; 0x1) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="YES" edc:desc="Error" edc:when="(field &amp; 0x1) == 0x01"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="CMDNI" edc:nzwidth="0x1" edc:desc="Command not Issued By Auto CMD12 Error">
              <edc:SFRFieldSemantic edc:cname="OK" edc:desc="No error" edc:when="(field &amp; 0x1) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="NOT_ISSUED" edc:desc="Not Issued" edc:when="(field &amp; 0x1) == 0x01"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="SDHC1" edc:cname="HC2R" edc:nzwidth="0x10" edc:access="nn------nnnnnnnn" edc:por="0000000000000000" edc:mclr="0000000000000000" edc:impl="0xC0FF" edc:_addr="0x4600003E">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SDHC1">
            <edc:SFRFieldDef edc:cname="HS200EN" edc:nzwidth="0x4" edc:desc="HS200 Mode Enable">
              <edc:SFRFieldSemantic edc:cname="SDR12" edc:desc="SDR12" edc:when="(field &amp; 0xF) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="SDR25" edc:desc="SDR25" edc:when="(field &amp; 0xF) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="SDR50" edc:desc="SDR50" edc:when="(field &amp; 0xF) == 0x02"/>
              <edc:SFRFieldSemantic edc:cname="SDR104" edc:desc="SDR104" edc:when="(field &amp; 0xF) == 0x03"/>
              <edc:SFRFieldSemantic edc:cname="DDR50" edc:desc="DDR50" edc:when="(field &amp; 0xF) == 0x04"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="-1"/>
            <edc:SFRFieldDef edc:cname="VS18EN" edc:nzwidth="0x1" edc:desc="1.8V Signaling Enable">
              <edc:SFRFieldSemantic edc:cname="S33V" edc:desc="3.3V Signaling" edc:when="(field &amp; 0x1) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="S18V" edc:desc="1.8V Signaling" edc:when="(field &amp; 0x1) == 0x01"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="DRVSEL" edc:nzwidth="0x2" edc:desc="Driver Strength Select">
              <edc:SFRFieldSemantic edc:cname="B" edc:desc="Driver Type B is Selected (Default)" edc:when="(field &amp; 0x3) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="A" edc:desc="Driver Type A is Selected" edc:when="(field &amp; 0x3) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="C" edc:desc="Driver Type C is Selected" edc:when="(field &amp; 0x3) == 0x02"/>
              <edc:SFRFieldSemantic edc:cname="D" edc:desc="Driver Type D is Selected" edc:when="(field &amp; 0x3) == 0x03"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="EXTUN" edc:nzwidth="0x1" edc:desc="Execute Tuning">
              <edc:SFRFieldSemantic edc:cname="NO" edc:desc="Not Tuned or Tuning Completed" edc:when="(field &amp; 0x1) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="REQUESTED" edc:desc="Execute Tuning" edc:when="(field &amp; 0x1) == 0x01"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="SLCKSEL" edc:nzwidth="0x1" edc:desc="Sampling Clock Select">
              <edc:SFRFieldSemantic edc:cname="FIXED" edc:desc="Fixed clock is used to sample data" edc:when="(field &amp; 0x1) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="TUNED" edc:desc="Tuned clock is used to sample data" edc:when="(field &amp; 0x1) == 0x01"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x6"/>
            <edc:SFRFieldDef edc:cname="ASINTEN" edc:nzwidth="0x1" edc:desc="Asynchronous Interrupt Enable">
              <edc:SFRFieldSemantic edc:cname="DISABLED" edc:desc="Disabled" edc:when="(field &amp; 0x1) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="ENABLED" edc:desc="Enabled" edc:when="(field &amp; 0x1) == 0x01"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="PVALEN" edc:nzwidth="0x1" edc:desc="Preset Value Enable">
              <edc:SFRFieldSemantic edc:cname="HOST" edc:desc="SDCLK and Driver Strength are controlled by Host Controller" edc:when="(field &amp; 0x1) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="AUTO" edc:desc="Automatic Selection by Preset Value is Enabled" edc:when="(field &amp; 0x1) == 0x01"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
