Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-SG60_DFP/1.1.122/edc/PIC32CX1025SG60100.PIC
      <edc:SFRDef ltx:memberofperipheral="SystemControl" edc:cname="AIRCR" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnn----nnn-----nnn" edc:por="11111010000001010000000000000000" edc:mclr="11111010000001010000000000000000" edc:impl="0xFFFF8707" edc:_addr="0xE000ED0C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SystemControl">
            <edc:SFRFieldDef edc:cname="VECTRESET" edc:nzwidth="0x1" edc:desc="Must write 0"/>
            <edc:SFRFieldDef edc:cname="VECTCLRACTIVE" edc:nzwidth="0x1" edc:desc="Must write 0"/>
            <edc:SFRFieldDef edc:cname="SYSRESETREQ" edc:nzwidth="0x1" edc:desc="System Reset Request">
              <edc:SFRFieldSemantic edc:cname="VALUE_0" edc:desc="No system reset request" edc:when="(field &amp; 0x1) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="VALUE_1" edc:desc="Asserts a signal to the outer system that requests a reset" edc:when="(field &amp; 0x1) == 0x01"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x5"/>
            <edc:SFRFieldDef edc:cname="PRIGROUP" edc:nzwidth="0x3" edc:desc="Interrupt priority grouping"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="ENDIANNESS" edc:nzwidth="0x1" edc:desc="Data endianness, 0=little, 1=big">
              <edc:SFRFieldSemantic edc:cname="VALUE_0" edc:desc="Little-endian" edc:when="(field &amp; 0x1) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="VALUE_1" edc:desc="Big-endian" edc:when="(field &amp; 0x1) == 0x01"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="VECTKEY" edc:nzwidth="0x10" edc:desc="Register key"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="SystemControl" edc:cname="SCR" edc:nzwidth="0x20" edc:access="---------------------------n-nn-" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0x16" edc:_addr="0xE000ED10">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SystemControl">
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="SLEEPONEXIT" edc:nzwidth="0x1" edc:desc="Sleep-on-exit on handler return">
              <edc:SFRFieldSemantic edc:cname="VALUE_0" edc:desc="Do not sleep when returning to Thread mode" edc:when="(field &amp; 0x1) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="VALUE_1" edc:desc="Enter sleep, or deep sleep, on return from an ISR" edc:when="(field &amp; 0x1) == 0x01"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="SLEEPDEEP" edc:nzwidth="0x1" edc:desc="Deep Sleep used as low power mode">
              <edc:SFRFieldSemantic edc:cname="VALUE_0" edc:desc="Sleep" edc:when="(field &amp; 0x1) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="VALUE_1" edc:desc="Deep sleep" edc:when="(field &amp; 0x1) == 0x01"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="SEVONPEND" edc:nzwidth="0x1" edc:desc="Send Event on Pending bit">
              <edc:SFRFieldSemantic edc:cname="VALUE_0" edc:desc="Only enabled interrupts or events can wakeup the processor, disabled interrupts are excluded" edc:when="(field &amp; 0x1) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="VALUE_1" edc:desc="Enabled events and all interrupts, including disabled interrupts, can wakeup the processor" edc:when="(field &amp; 0x1) == 0x01"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="SystemControl" edc:cname="CCR" edc:nzwidth="0x20" edc:access="----------------------nn---nn-nn" edc:por="00000000000000000000001000000000" edc:mclr="00000000000000000000001000000000" edc:impl="0x31B" edc:_addr="0xE000ED14">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SystemControl">
            <edc:SFRFieldDef edc:cname="NONBASETHRDENA" edc:nzwidth="0x1" edc:desc="Indicates how processor enters Thread mode"/>
            <edc:SFRFieldDef edc:cname="USERSETMPEND" edc:nzwidth="0x1" edc:desc="Enables unprivileged software access to STIR register"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="UNALIGN_TRP" edc:nzwidth="0x1" edc:desc="Enables unaligned access traps">
              <edc:SFRFieldSemantic edc:cname="VALUE_0" edc:desc="Do not trap unaligned halfword and word accesses" edc:when="(field &amp; 0x1) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="VALUE_1" edc:desc="Trap unaligned halfword and word accesses" edc:when="(field &amp; 0x1) == 0x01"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="DIV_0_TRP" edc:nzwidth="0x1" edc:desc="Enables divide by 0 trap"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="BFHFNMIGN" edc:nzwidth="0x1" edc:desc="Ignore LDM/STM BusFault for -1/-2 priority handlers"/>
            <edc:SFRFieldDef edc:cname="STKALIGN" edc:nzwidth="0x1" edc:desc="Indicates stack alignment on exception entry">
              <edc:SFRFieldSemantic edc:cname="VALUE_0" edc:desc="4-byte aligned" edc:when="(field &amp; 0x1) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="VALUE_1" edc:desc="8-byte aligned" edc:when="(field &amp; 0x1) == 0x01"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="SystemControl" edc:cname="SHPR1" edc:nzwidth="0x20" edc:access="--------nnnnnnnnnnnnnnnnnnnnnnnn" edc:impl="0xFFFFFF" edc:_addr="0xE000ED18">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SystemControl">
            <edc:SFRFieldDef edc:cname="PRI_4" edc:nzwidth="0x8" edc:desc="Priority of system handler 4, MemManage"/>
            <edc:SFRFieldDef edc:cname="PRI_5" edc:nzwidth="0x8" edc:desc="Priority of system handler 5, BusFault"/>
            <edc:SFRFieldDef edc:cname="PRI_6" edc:nzwidth="0x8" edc:desc="Priority of system handler 6, UsageFault"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="SystemControl" edc:cname="SHPR2" edc:nzwidth="0x20" edc:access="nnnnnnnn------------------------" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0xFF000000" edc:_addr="0xE000ED1C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SystemControl">
            <edc:AdjustPoint edc:offset="0x18"/>
            <edc:SFRFieldDef edc:cname="PRI_11" edc:nzwidth="0x8" edc:desc="Priority of system handler 11, SVCall"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="SystemControl" edc:cname="SHPR3" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnn----------------" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0xFFFF0000" edc:_addr="0xE000ED20">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SystemControl">
            <edc:AdjustPoint edc:offset="0x10"/>
            <edc:SFRFieldDef edc:cname="PRI_14" edc:nzwidth="0x8" edc:desc="Priority of system handler 14, PendSV"/>
            <edc:SFRFieldDef edc:cname="PRI_15" edc:nzwidth="0x8" edc:desc="Priority of system handler 15, SysTick exception"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="SystemControl" edc:cname="SHCSR" edc:nzwidth="0x20" edc:access="-------------nnnnnnnnn-nn---n-nn" edc:impl="0x7FD8B" edc:_addr="0xE000ED24">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SystemControl">
            <edc:SFRFieldDef edc:cname="MEMFAULTACT" edc:nzwidth="0x1" edc:desc="MemManage exception active bit"/>
            <edc:SFRFieldDef edc:cname="BUSFAULTACT" edc:nzwidth="0x1" edc:desc="BusFault exception active bit"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="USGFAULTACT" edc:nzwidth="0x1" edc:desc="UsageFault exception active bit"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="SVCALLACT" edc:nzwidth="0x1" edc:desc="SVCall active bit"/>
            <edc:SFRFieldDef edc:cname="MONITORACT" edc:nzwidth="0x1" edc:desc="DebugMonitor exception active bit"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="PENDSVACT" edc:nzwidth="0x1" edc:desc="PendSV exception active bit"/>
            <edc:SFRFieldDef edc:cname="SYSTICKACT" edc:nzwidth="0x1" edc:desc="SysTick exception active bit"/>
            <edc:SFRFieldDef edc:cname="USGFAULTPENDED" edc:nzwidth="0x1" edc:desc="UsageFault exception pending bit"/>
            <edc:SFRFieldDef edc:cname="MEMFAULTPENDED" edc:nzwidth="0x1" edc:desc="MemManage exception pending bit"/>
            <edc:SFRFieldDef edc:cname="BUSFAULTPENDED" edc:nzwidth="0x1" edc:desc="BusFault exception pending bit"/>
            <edc:SFRFieldDef edc:cname="SVCALLPENDED" edc:nzwidth="0x1" edc:desc="SVCall pending bit"/>
            <edc:SFRFieldDef edc:cname="MEMFAULTENA" edc:nzwidth="0x1" edc:desc="MemManage enable bit"/>
            <edc:SFRFieldDef edc:cname="BUSFAULTENA" edc:nzwidth="0x1" edc:desc="BusFault enable bit"/>
            <edc:SFRFieldDef edc:cname="USGFAULTENA" edc:nzwidth="0x1" edc:desc="UsageFault enable bit"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="SystemControl" edc:cname="CFSR" edc:nzwidth="0x20" edc:access="------nn----nnnnn-nnnnnnn-nnn-nn" edc:impl="0x30FBFBB" edc:_addr="0xE000ED28">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SystemControl">
            <edc:SFRFieldDef edc:cname="IACCVIOL" edc:nzwidth="0x1" edc:desc="Instruction access violation"/>
            <edc:SFRFieldDef edc:cname="DACCVIOL" edc:nzwidth="0x1" edc:desc="Data access violation"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="MUNSTKERR" edc:nzwidth="0x1" edc:desc="MemManage Fault on unstacking for exception return"/>
            <edc:SFRFieldDef edc:cname="MSTKERR" edc:nzwidth="0x1" edc:desc="MemManage Fault on stacking for exception entry"/>
            <edc:SFRFieldDef edc:cname="MLSPERR" edc:nzwidth="0x1" edc:desc="MemManager Fault occured during FP lazy state preservation"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="MMARVALID" edc:nzwidth="0x1" edc:desc="MemManage Fault Address Register valid"/>
            <edc:SFRFieldDef edc:cname="IBUSERR" edc:nzwidth="0x1" edc:desc="Instruction bus error"/>
            <edc:SFRFieldDef edc:cname="PRECISERR" edc:nzwidth="0x1" edc:desc="Precise data bus error"/>
            <edc:SFRFieldDef edc:cname="IMPRECISERR" edc:nzwidth="0x1" edc:desc="Imprecise data bus error"/>
            <edc:SFRFieldDef edc:cname="UNSTKERR" edc:nzwidth="0x1" edc:desc="BusFault on unstacking for exception return"/>
            <edc:SFRFieldDef edc:cname="STKERR" edc:nzwidth="0x1" edc:desc="BusFault on stacking for exception entry"/>
            <edc:SFRFieldDef edc:cname="LSPERR" edc:nzwidth="0x1" edc:desc="BusFault occured during FP lazy state preservation"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="BFARVALID" edc:nzwidth="0x1" edc:desc="BusFault Address Register valid"/>
            <edc:SFRFieldDef edc:cname="UNDEFINSTR" edc:nzwidth="0x1" edc:desc="Undefined instruction UsageFault"/>
            <edc:SFRFieldDef edc:cname="INVSTATE" edc:nzwidth="0x1" edc:desc="Invalid state UsageFault"/>
            <edc:SFRFieldDef edc:cname="INVPC" edc:nzwidth="0x1" edc:desc="Invalid PC load UsageFault"/>
            <edc:SFRFieldDef edc:cname="NOCP" edc:nzwidth="0x1" edc:desc="No coprocessor UsageFault"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="UNALIGNED" edc:nzwidth="0x1" edc:desc="Unaligned access UsageFault"/>
            <edc:SFRFieldDef edc:cname="DIVBYZERO" edc:nzwidth="0x1" edc:desc="Divide by zero UsageFault"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="SystemControl" edc:cname="HFSR" edc:nzwidth="0x20" edc:access="nn----------------------------n-" edc:impl="0xC0000002" edc:_addr="0xE000ED2C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SystemControl">
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="VECTTBL" edc:nzwidth="0x1" edc:desc="BusFault on a Vector Table read during exception processing"/>
            <edc:AdjustPoint edc:offset="0x1C"/>
            <edc:SFRFieldDef edc:cname="FORCED" edc:nzwidth="0x1" edc:desc="Forced Hard Fault"/>
            <edc:SFRFieldDef edc:cname="DEBUGEVT" edc:nzwidth="0x1" edc:desc="Debug: always write 0"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="SystemControl" edc:cname="DFSR" edc:nzwidth="0x20" edc:access="---------------------------nnnnn" edc:impl="0x1F" edc:_addr="0xE000ED30">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SystemControl">
            <edc:SFRFieldDef edc:cname="HALTED" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="BKPT" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DWTTRAP" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="VCATCH" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EXTERNAL" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="SystemControl" edc:cname="MMFAR" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:_addr="0xE000ED34">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SystemControl">
            <edc:SFRFieldDef edc:cname="ADDRESS" edc:nzwidth="0x20" edc:desc="Address that generated the MemManage fault"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="SystemControl" edc:cname="BFAR" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:_addr="0xE000ED38">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SystemControl">
            <edc:SFRFieldDef edc:cname="ADDRESS" edc:nzwidth="0x20" edc:desc="Address that generated the BusFault"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="SystemControl" edc:cname="AFSR" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:_addr="0xE000ED3C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SystemControl">
            <edc:SFRFieldDef edc:cname="IMPDEF" edc:nzwidth="0x20" edc:desc="AUXFAULT input signals"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="SystemControl" edc:cname="PFR0" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:_addr="0xE000ED40"/>
      <edc:SFRDef ltx:memberofperipheral="SystemControl" edc:cname="PFR1" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:_addr="0xE000ED44"/>
      <edc:SFRDef ltx:memberofperipheral="SystemControl" edc:cname="DFR" edc:nzwidth="0x20" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:_addr="0xE000ED48"/>
      <edc:SFRDef ltx:memberofperipheral="SystemControl" edc:cname="ADR" edc:nzwidth="0x20" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:_addr="0xE000ED4C"/>
      <edc:SFRDef ltx:memberofperipheral="SystemControl" edc:cname="MMFR0" edc:nzwidth="0x20" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:_addr="0xE000ED50"/>
      <edc:SFRDef ltx:memberofperipheral="SystemControl" edc:cname="MMFR1" edc:nzwidth="0x20" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:_addr="0xE000ED54"/>
      <edc:SFRDef ltx:memberofperipheral="SystemControl" edc:cname="MMFR2" edc:nzwidth="0x20" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:_addr="0xE000ED58"/>
      <edc:SFRDef ltx:memberofperipheral="SystemControl" edc:cname="MMFR3" edc:nzwidth="0x20" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:_addr="0xE000ED5C"/>
      <edc:SFRDef ltx:memberofperipheral="SystemControl" edc:cname="ISAR0" edc:nzwidth="0x20" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:_addr="0xE000ED60"/>
      <edc:SFRDef ltx:memberofperipheral="SystemControl" edc:cname="ISAR1" edc:nzwidth="0x20" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:_addr="0xE000ED64"/>
      <edc:SFRDef ltx:memberofperipheral="SystemControl" edc:cname="ISAR2" edc:nzwidth="0x20" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:_addr="0xE000ED68"/>
      <edc:SFRDef ltx:memberofperipheral="SystemControl" edc:cname="ISAR3" edc:nzwidth="0x20" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:_addr="0xE000ED6C"/>
      <edc:SFRDef ltx:memberofperipheral="SystemControl" edc:cname="ISAR4" edc:nzwidth="0x20" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:_addr="0xE000ED70"/>
      <edc:AdjustPoint edc:offset="0x14" edc:_addr="0xE000ED74"/>
      <edc:SFRDef ltx:memberofperipheral="SystemControl" edc:cname="CPACR" edc:nzwidth="0x20" edc:access="--------nnnn--------------------" edc:impl="0xF00000" edc:_addr="0xE000ED88">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SystemControl">
            <edc:AdjustPoint edc:offset="0x14"/>
            <edc:SFRFieldDef edc:cname="CP10" edc:nzwidth="0x2" edc:desc="Access privileges for coprocessor 10">
              <edc:SFRFieldSemantic edc:cname="DENIED" edc:desc="Access denied" edc:when="(field &amp; 0x3) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="PRIV" edc:desc="Privileged access only" edc:when="(field &amp; 0x3) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="FULL" edc:desc="Full access" edc:when="(field &amp; 0x3) == 0x03"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="CP11" edc:nzwidth="0x2" edc:desc="Access privileges for coprocessor 11">
              <edc:SFRFieldSemantic edc:cname="DENIED" edc:desc="Access denied" edc:when="(field &amp; 0x3) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="PRIV" edc:desc="Privileged access only" edc:when="(field &amp; 0x3) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="FULL" edc:desc="Full access" edc:when="(field &amp; 0x3) == 0x03"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x4" edc:_addr="0xE000ED8C"/>
      <edc:SFRDef ltx:memberofperipheral="MPU" edc:cname="TYPE" edc:nzwidth="0x20" edc:access="--------rrrrrrrrrrrrrrrr-------r" edc:impl="0xFFFF01" edc:_addr="0xE000ED90">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MPU">
            <edc:SFRFieldDef edc:cname="SEPARATE" edc:nzwidth="0x1" edc:desc="Separate instruction and Data Memory MapsRegions"/>
            <edc:AdjustPoint edc:offset="0x7"/>
            <edc:SFRFieldDef edc:cname="DREGION" edc:nzwidth="0x8" edc:desc="Number of Data Regions"/>
            <edc:SFRFieldDef edc:cname="IREGION" edc:nzwidth="0x8" edc:desc="Number of Instruction Regions"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="MPU" edc:cname="CTRL" edc:nzwidth="0x20" edc:access="-----------------------------nnn" edc:impl="0x7" edc:_addr="0xE000ED94">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MPU">
            <edc:SFRFieldDef edc:cname="ENABLE" edc:nzwidth="0x1" edc:desc="MPU Enable"/>
            <edc:SFRFieldDef edc:cname="HFNMIENA" edc:nzwidth="0x1" edc:desc="Enable Hard Fault and NMI handlers"/>
            <edc:SFRFieldDef edc:cname="PRIVDEFENA" edc:nzwidth="0x1" edc:desc="Enables privileged software access to default memory map"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="MPU" edc:cname="RNR" edc:nzwidth="0x20" edc:access="------------------------nnnnnnnn" edc:impl="0xFF" edc:_addr="0xE000ED98">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MPU">
            <edc:SFRFieldDef edc:cname="REGION" edc:nzwidth="0x8" edc:desc="Region referenced by RBAR and RASR"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="MPU" edc:cname="RBAR" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:_addr="0xE000ED9C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MPU">
            <edc:SFRFieldDef edc:cname="REGION" edc:nzwidth="0x4" edc:desc="Region number"/>
            <edc:SFRFieldDef edc:cname="VALID" edc:nzwidth="0x1" edc:desc="Region number valid"/>
            <edc:SFRFieldDef edc:cname="ADDR" edc:nzwidth="0x1B" edc:desc="Region base address"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="MPU" edc:cname="RASR" edc:nzwidth="0x20" edc:access="---n-nnn--nnnnnnnnnnnnnn------nn" edc:impl="0x173FFF03" edc:_addr="0xE000EDA0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MPU">
            <edc:SFRFieldDef edc:cname="ENABLE" edc:nzwidth="0x1" edc:desc="Region Enable"/>
            <edc:SFRFieldDef edc:cname="SIZE" edc:nzwidth="0x1" edc:desc="Region Size"/>
            <edc:AdjustPoint edc:offset="0x6"/>
            <edc:SFRFieldDef edc:cname="SRD" edc:nzwidth="0x8" edc:desc="Sub-region disable"/>
            <edc:SFRFieldDef edc:cname="B" edc:nzwidth="0x1" edc:desc="Bufferable bit"/>
            <edc:SFRFieldDef edc:cname="C" edc:nzwidth="0x1" edc:desc="Cacheable bit"/>
            <edc:SFRFieldDef edc:cname="S" edc:nzwidth="0x1" edc:desc="Shareable bit"/>
            <edc:SFRFieldDef edc:cname="TEX" edc:nzwidth="0x3" edc:desc="TEX bit"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="AP" edc:nzwidth="0x3" edc:desc="Access Permission"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="XN" edc:nzwidth="0x1" edc:desc="Execute Never Attribute"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="MPU" edc:cname="RBAR_A1" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:_addr="0xE000EDA4">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MPU">
            <edc:SFRFieldDef edc:cname="REGION" edc:nzwidth="0x4" edc:desc="Region number"/>
            <edc:SFRFieldDef edc:cname="VALID" edc:nzwidth="0x1" edc:desc="Region number valid"/>
            <edc:SFRFieldDef edc:cname="ADDR" edc:nzwidth="0x1B" edc:desc="Region base address"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
